tsung/unit/admin_gp_3.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.6.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" dumptraffic="protocol" version="1.0">


  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000" />
  </clients>


  <!-- Server side setup -->
  <servers>
    <server host="server_host" port="80" type="tcp"></server>
  </servers>


  <!-- User arrival rates -->
  <load>
      <arrivalphase phase="1" duration="30" unit="second">
          <users arrivalrate="1" unit="second"></users>
      </arrivalphase>

      <arrivalphase phase="2" duration="30" unit="second">
          <users arrivalrate="2" unit="second"></users>
      </arrivalphase>

      <arrivalphase phase="3" duration="30" unit="second">
          <users arrivalrate="4" unit="second"></users>
      </arrivalphase>
  </load>


  <!-- Configuration -->
  <options>
    <option name="global_ack_timeout" value="20000"></option>
      <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>


  <sessions>
    <!-- Admin session begins -->
    <session name="admin_session" probability="100" type="ts_http">

      <!-- Admin logs in to the system -->
      <transaction name="login">
        <request>
          <dyn_variable name="authenticity_token"></dyn_variable>
          <http url="/users/sign_in" version='1.1' method='GET'></http>
        </request>

        <thinktime value="2" random="true"></thinktime>

        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})-&gt;{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
          <var name="authenticity_token" />
        </setdynvars>

        <setdynvars sourcetype="random_number" start="1" end="10000">
          <var name="random_email_number" />
        </setdynvars>

        <request subst="true">
          <http url="/users/sign_in" method="POST" version="1.1"
          contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=user%%_random_email_number%%@bid.com&amp;user%5Bpassword%5D=password&amp;user%5Bremember_me%5D=0"></http>
        </request>
      </transaction>


      <thinktime value="2" random="true"></thinktime>


      <!-- Admin adds a product category -->
      <transaction name="admin_add_category">
        <setdynvars sourcetype="random_number" start="1" end="9999">
          <var name="category_number" />
        </setdynvars>

        <request>
          <dyn_variable name="authenticity_token"></dyn_variable>
          <http url='/categories/new' version='1.1' method='GET'></http>
        </request>

        <thinktime value="2" random="true"></thinktime>

        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})-&gt;{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
            <var name="authenticity_token" />
        </setdynvars>

        <request subst="true">
          <http url="/categories" method="POST" version="1.1"
          contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%&amp;category%5Bname%5D=category_%%_category_number%%&amp;category%5Bdescription%5D=this_is_the_description_of_category_%%_category_number%%"></http>
        </request>
      </transaction>


      <thinktime value="2" random="true"></thinktime>


      <!-- Admin lists all the categories -->
      <transaction name="admin_show_category">
        <request>
          <dyn_variable name="authenticity_token" xpath="//meta[@name='csrf-token']/@content"></dyn_variable>
          <http url='/categories' version='1.1' method='GET'></http>
        </request>
      </transaction>


      <!-- Admin logs out of the system -->
      <transaction name="log_out">
        <setdynvars sourcetype="eval" code="fun({Pid,DynVars})-&gt;{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),re:replace(Val,&quot;[+]&quot;,&quot;%2B&quot;,[global, {return,list}]) end.">
            <var name="authenticity_token" />
        </setdynvars>

        <request subst="true">
          <http url="/users/sign_out" version="1.1" method="DELETE" contents="utf8=%E2%9C%93&amp;authenticity_token=%%_authenticity_token%%"></http>
        </request>
      </transaction>


      <!-- Display the dynamic variables -->
      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) -> io:format([126, $p, 126, $n, 126, $n], [DynVars]), ok end.">
        <var name="value" />
      </setdynvars>

    <!-- Admin session ends -->
    </session>

  </sessions>
</tsung>